#+title: Emacs 使用再记（5）- 用 org-mode 进行文学编程
#+author: SouthFox
#+date: 2026-03-26 19:00:00
#+tags: Lisp:Org mode:Emacs

在代码里写注释，还是……在注释里写代码？

,(read-more)

在配置了安卓 Emacs（[[/2024/12/emacs-everywhere/][Emacs 使用再记（4）- EMACS EVERYWHERE!]]）一年后，我已经有好些笔记和日志通过手机来编写了，毕竟
有时候懒得打开电脑就想躺在床上。一切都挺好，只要快快把内容输入到 [[https://www.orgroam.com/][org-roam]] 里并对在安卓机上用 Emacs 小问题
视而不见，收紧折腾的心即可。不过最近我的手机厂商推送安卓 16 更新成功搞坏了 Termux ，打开后直接闪退根本无法正常使用。
这个 Termux 是专门为安卓 Emacs 编译的，背后使用了相同的 ID 签名还是什么的，总之能让 Emacs 使用 Termux 安装
如 git, rg, curl 之类的终端工具。这一年使用下来发现我不怎么依赖这些，最多也就用用 git 克隆仓库拉下配置而已，这样的话想着
能不能只用 Emacs 来完成拉取配置呢？是可以的，因为 Emacs 内置了 =url-copy-file= 函数用 http(s) 协议下载文件。之前还有点
不解 Emacs 为什么要内置网络操作而不直接依赖 curl ，现在实际用上了就感叹：真好啊，能在编辑器里原生做一些网络操作。

用 =url-copy-file= 就能解决大部分问题了，不过想着来都来了，就把之前看着不爽的问题给统统解决了吧，然后开始整起配置来。鼓捣着
发现需要弄多个文件，很简单，仓库推个文件然后再用 =url-copy-file= 就好了……吗？感觉这样太累了，要不停维护相关的配置
和 URL 的映射，那么又没有什么办法将相关的代码当成 *产物* 然后通过什么步骤生成出来呢？没错，就是 org mode ！

** org mode power
org mode 是 emacs 上的主模式，作为标记语法和 markdown 差不多，标题、强调样式（加粗、斜体、行内代码）、列表、链接
等，但这只是 org mode 的一部分，org mode 代码块是和标记语法同级的另一部分，简单代码块示例如下：

#+begin_example
#+begin_src python
return "Hello World!"
#+end_src
#+end_example

表面上看用 =#+begin_src= 和 =#+end_src= 这种有点字多的方式标识代码块外，更重要的是可以在 emacs 里执行它，将光标
放在这个代码块上按下 C-c C-c 后，就能执行了 [fn:1] ，没有意外的话就会在下面出现 =#+RESULTS:= 的文本显示
执行结果：

#+begin_example
#+begin_src python
return "Hello World!"
#+end_src

#+RESULTS:
: Hello World!
#+end_example

嗯，简单有效，但就只有这样吗？

